#include <stdio.h>

int main(){
    printf("\n\n\n\n\n\n=============================================================\n");
    printf("Hello this is my first Homework: \n");
    printf("Task 1: Вывести на экран “Hello world!”: \n");
    printf("Hello World!\n");
    printf("------------------------------------------------------------\n");
    printf("Task 2: Вывести на экран текст \"лесенкой\": \n");
    printf("Let`s\n   go\n    to walk\n");
    printf("------------------------------------------------------------\n");
    printf("Task 3: Вывести на экран рисунок из букв: \n");
    printf("         *\n        ***\n       *****\n      *******\n       HH HH\n       ZZZZZ\n");
    printf("------------------------------------------------------------\n");
    printf("Task 4*: Нарисовать соты: \n");
    printf("   ___     ___\n  /   \\___/   \\ \n  \\___/   \\___/ \n  /   \\___/   \\ \n  \\___/   \\___/ \n");
    printf("=============================================================\n");
    return 0;
}